#define _CRT_SECURE_NO_WARNINGS // для возможности использования scanf

#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include <time.h>

// Class work:
// 1 - односвязные
// 2 - двусвязные
// 3 - циклические списки
// 4 - стек на основе односвязного списка
// 5 - очередь на основе двухсвязного списка



// Home work:
// 1 - Написать программу, которая определяет, является ли введенная скобочная последовательность правильной.
// Примеры правильных скобочных выражений : (), ([])(), {}(), ([{}]), 
// неправильных — )(, ())({ ), (, ]) }), ([(]) для скобок[, (, { .
// Например: (2 + (2 * 2)) или[2 / {5 * (4 + 7)}]
// 2 - Создать функцию, копирующую односвязный список(без удаления первого списка).
// 3 - Реализуйте алгоритм, который определяет, отсортирован ли связный список.

int main(const int argc, const char** argv) {




}
